In [1]:
import pandas as pd
import numpy as np

In [2]:

df=pd.read_excel('annvoa.xlsx')

In [3]:
df

   Wheat Type A  Wheat Type B  Wheat Type C
0             6             5             5
1             7             5             4
2             3             3             3
3             8             7             4

In [4]:
# Now convert the 3 columns to 2 columns
df_new=pd.melt(df.reset_index(), id_vars=None, value_vars=["Wheat Type A","Wheat Type B","Wheat Type C"])

In [5]:
df_new.columns=["Type","Quantity"]

In [6]:
df_new

            Type  Quantity
0   Wheat Type A         6
1   Wheat Type A         7
2   Wheat Type A         3
3   Wheat Type A         8
4   Wheat Type B         5
5   Wheat Type B         5
6   Wheat Type B         3
7   Wheat Type B         7
8   Wheat Type C         5
9   Wheat Type C         4
10  Wheat Type C         3
11  Wheat Type C         4

In [7]:
from scipy import stats
import statsmodels.api as sm
from statsmodels.formula.api import ols

In [17]:
model=ols("Quantity ~ Type",df_new).fit()

In [18]:
one_way_anova=sm.stats.anova_lm(model,Type=1)

In [19]:
one_way_anova

           df  sum_sq   mean_sq    F    PR(>F)
Type      2.0     8.0  4.000000  1.5  0.274016
Residual  9.0    24.0  2.666667  NaN       NaN

In [20]:
# So we will accept the null hypothesis